# Astronaut Flight Records: Reshaping List-Like Data

## Table of Contents

1. Introduction
2. Install & Import Packages
3. Read In & Check Data
4. High-Level Exploration
5. Reshape List-Like Data

## 1. Introduction

We often encounter messy list-like or string data that needs to be reshaped into separate rows for futher analysis, including genres, reviews, products, names, etc. Today, we'll walk through reshaping and cleaning up list-like data. We'll work with astronaut flight records from the CSIS International Astronaut Database (https://aerospace.csis.org/data/international-astronaut-database/) in which "astronaut" is defined as someone who has flown to an altitude of 100km or higher. The 'Flights' column includes a string of spacecraft for each astronaut. 

Before reshaping, we couldn't help but do some high-level exploration of the original data. We discovered that:

- 568 people, including 504 men and 64 women, from 42 countries have gone to space
- Humans have spent a total of 55918 days, 7005 hours, and 16323 minutes in space
- Gennady Padalka from Russia has spent the most amount of time in space at 878 days, 11 hours, and 29 minutes

We've also created dataframes for all women who've gone to space and number of astronauts by country. There's alot more we could dig into like flights and country trends over time, but let's focus on reshaping.

To reshape list-like data into separate rows, we'll set .assign() to values of split strings to 'Flights' column and apply .explode(). We'll create new Spacecraft and Year columns, splitting original messy 'Flights' string and set expand argument to True to create new columns. We'll then clean up and set the dataframe to the format we want. The purpose is to reshape list-like data into a dataframe focused on individual astronauts with each spacecraft in which they traveled.

## 2. Install & Import Packages

In [344]:
import pandas as pd
import numpy as np
from datetime import datetime

## 3. Read In & Check Data

In [345]:
# The code was removed by Watson Studio for sharing.

In [346]:
# Read in dataframe
astronauts = pd.read_csv(body)

# Check first and last 5 rows - we see that 'Flights' is column of comma-separated strings
pd.concat([astronauts.head(), astronauts.tail()])

,Name,Country,Gender,Flights,Total Flights,Total Flight Time (ddd:hh:mm)
0,Zhang Xiaoguang,China,Man,Shenzhou 10 (2013),1,014:14:28
1,Zhai Zhigang,China,Man,Shenzhou 7 (2008),1,002:20:26
2,Yury Usachov,Russia,Man,"Soyuz TM-18 (1994), Soyuz TM-23 (1996), STS-10...",4,552:22:24
3,Yuri Shargin,Russia,Man,Soyuz TMA-5 (2004),1,009:21:29
4,Yuri Romanenko,Soviet Union,Man,"Soyuz 26 (1977), Soyuz 38 (1980), Soyuz TM-2 (...",3,430:18:21
563,Alan Shepard,United States,Man,"Mercury-Redstone 3 (1961), Apollo 14 (1971)",2,009:00:17
564,Alan G. Poindexter,United States,Man,"STS-122 (2008), STS-131 (2010)",2,027:21:09
565,Alan Bean,United States,Man,"Apollo 12 (1969), Skylab 3 (1973)",2,069:15:45
566,Akihiko Hoshide,Japan,Man,"STS-124 (2008), Soyuz TMA-05M (2012)",2,140:17:26
567,Abdul Ahad Mohmand,Afghanistan,Man,Soyuz TM-6 (1988),1,008:20:26

In [347]:
# Let's check shape - 568 astronauts have traveled to space
astronauts.shape

(568, 6)

In [348]:
# Check data types
astronauts.dtypes

Name                             object
Country                          object
Gender                           object
Flights                          object
Total Flights                     int64
Total Flight Time (ddd:hh:mm)    object
dtype: object

In [349]:
# Replace gender values with M and F
astronauts['Gender'] = astronauts['Gender'].replace('Man','M')
astronauts['Gender'] = astronauts['Gender'].replace('Woman','F')

In [350]:
# Total Flight Time is a string, lets create new columns for days, hours minutes, splitting original string, set expand to True to create new columns 
astronauts[['Days','Hours','Minutes']] = astronauts['Total Flight Time (ddd:hh:mm)'].str.split(':', expand=True)

# Change data types of new columns to int
astronauts.Days = astronauts.Days.astype(int)
astronauts.Hours = astronauts.Hours.astype(int)
astronauts.Minutes = astronauts.Minutes.astype(int)

# Drop Total Flight Time column
astronauts.drop('Total Flight Time (ddd:hh:mm)', axis=1, inplace=True)

# Let's check
astronauts

,Name,Country,Gender,Flights,Total Flights,Days,Hours,Minutes
0,Zhang Xiaoguang,China,M,Shenzhou 10 (2013),1,14,14,28
1,Zhai Zhigang,China,M,Shenzhou 7 (2008),1,2,20,26
2,Yury Usachov,Russia,M,"Soyuz TM-18 (1994), Soyuz TM-23 (1996), STS-10...",4,552,22,24
3,Yuri Shargin,Russia,M,Soyuz TMA-5 (2004),1,9,21,29
4,Yuri Romanenko,Soviet Union,M,"Soyuz 26 (1977), Soyuz 38 (1980), Soyuz TM-2 (...",3,430,18,21
...,...,...,...,...,...,...,...,...
563,Alan Shepard,United States,M,"Mercury-Redstone 3 (1961), Apollo 14 (1971)",2,9,0,17
564,Alan G. Poindexter,United States,M,"STS-122 (2008), STS-131 (2010)",2,27,21,9
565,Alan Bean,United States,M,"Apollo 12 (1969), Skylab 3 (1973)",2,69,15,45
566,Akihiko Hoshide,Japan,M,"STS-124 (2008), Soyuz TMA-05M (2012)",2,140,17,26
567,Abdul Ahad Mohmand,Afghanistan,M,Soyuz TM-6 (1988),1,8,20,26

## 4. High-Level Exploration

In [351]:
# Number of astronauts and countries
print("{} people, including {} men and {} women, from {} countries have gone to space.".format(astronauts.Name.nunique(), 
                                                                                                   astronauts.Gender.value_counts()[0], 
                                                                                                   astronauts.Gender.value_counts()[1], 
                                                                                                   astronauts.Country.nunique()))

568 people, including 504 men and 64 women, from 42 countries have gone to space.

In [352]:
# Amount of total time in space
print("Humans have spent a total of {} days, {} hours, and {} minutes in space.".format(astronauts.Days.sum(),astronauts.Hours.sum(),astronauts.Minutes.sum()))

Humans have spent a total of 55918 days, 7005 hours, and 16323 minutes in space.

In [353]:
# Let's see who's spent the most of amount of time in space using idxmax() 
astronauts.loc[astronauts['Days'].idxmax()]

Name                                               Gennady Padalka
Country                                                     Russia
Gender                                                           M
Flights          Soyuz TM-28 (1998), Soyuz TMA-4 (2004), Soyuz ...
Total Flights                                                    5
Days                                                           878
Hours                                                           11
Minutes                                                         29
Name: 407, dtype: object

In [354]:
# Amount of total time in space
print("{} ({}) from {} has spent the most amount of time in space at {} days, {} hours, and {} minutes.".format(astronauts.loc[astronauts['Days'].idxmax()][0],
                                                                                         astronauts.loc[astronauts['Days'].idxmax()][2],
                                                                                         astronauts.loc[astronauts['Days'].idxmax()][1],
                                                                                         astronauts.loc[astronauts['Days'].idxmax()][-3],
                                                                                         astronauts.loc[astronauts['Days'].idxmax()][-2],
                                                                                         astronauts.loc[astronauts['Days'].idxmax()][-1]))

Gennady Padalka (M) from Russia has spent the most amount of time in space at 878 days, 11 hours, and 29 minutes.

In [355]:
# Women who've gone to space
women = astronauts[astronauts['Gender']=='F']
women

,Name,Country,Gender,Flights,Total Flights,Days,Hours,Minutes
14,Yi So-yeon,South Korea,F,Soyuz TMA-12 (2008),1,10,21,13
16,Yelena Serova,Russia,F,Soyuz TMA-14M (2014),1,167,5,42
17,Yelena Kondakova,Russia,F,"Soyuz TM-20 (1994), STS-84 (1997)",2,178,9,41
33,Wendy Lawrence,United States,F,"STS-67 (1995), STS-86 (1997), STS-91 (1998), S...",4,52,3,55
67,Valentina Tereshkova,Soviet Union,F,Vostok 6 (1963),1,2,22,50
...,...,...,...,...,...,...,...,...
514,Bonnie J. Dunbar,United States,F,"STS-61-A (1985), STS-32 (1990), STS-50 (1992),...",5,50,8,26
519,Barbara Morgan,United States,F,STS-118 (2007),1,12,17,56
525,Anousheh Ansari,Iran,F,Soyuz TMA-9 (2006),1,10,21,5
526,Anne McClain,United States,F,Soyuz MS-11 (2018),1,203,15,16
527,"Anna Lee Fisher, M.D.",United States,F,STS-51-A (1984),1,7,23,44

In [356]:
# Astronauts by country
countries = astronauts.Country.value_counts()
countries = pd.DataFrame(countries).rename(columns={'Country':'Astronauts'})
countries

                      Astronauts
United States                346
Soviet Union                  67
Russia                        56
Japan                         11
China                         11
Canada                        10
France                        10
Germany                       10
Italy                          7
United Kingdom                 3
Netherlands                    2
Bulgaria                       2
Kazakhstan                     2
Hungary                        2
Belgium                        2
South Korea                    1
Syria                          1
Czechoslovakia                 1
Romania                        1
Iran                           1
Spain                          1
Switzerland                    1
Denmark                        1
Cuba                           1
Slovakia                       1
Poland                         1
Malaysia                       1
Brazil                         1
Austria                        1
East Germany                   1
Sweden                         1
Vietnam                        1
India                          1
Saudi Arabia                   1
United Arab Emirates           1
Afghanistan                    1
Peru                           1
Ukraine                        1
Mexico                         1
Israel                         1
Mongolia                       1
South Africa                   1

## 5. Reshape List-Like Data

In [357]:
# Check our dataframe again - Flights has list-like data, let's split, add year column, and clean it up
astronauts.head()

,Name,Country,Gender,Flights,Total Flights,Days,Hours,Minutes
0,Zhang Xiaoguang,China,M,Shenzhou 10 (2013),1,14,14,28
1,Zhai Zhigang,China,M,Shenzhou 7 (2008),1,2,20,26
2,Yury Usachov,Russia,M,"Soyuz TM-18 (1994), Soyuz TM-23 (1996), STS-10...",4,552,22,24
3,Yuri Shargin,Russia,M,Soyuz TMA-5 (2004),1,9,21,29
4,Yuri Romanenko,Soviet Union,M,"Soyuz 26 (1977), Soyuz 38 (1980), Soyuz TM-2 (...",3,430,18,21

In [358]:
# Assign values of split strings to column 'Flight' and apply .explode to transform list-like column into separate rows
astronauts = astronauts.assign(Flights=astronauts['Flights'].str.split(',')).explode('Flights')

In [359]:
# The above keeps the original index. Let's reset the index 
astronauts.reset_index(drop=True, inplace=True)

# Let's check, we have more rows now as expected since we've separated flights into rows
astronauts

,Name,Country,Gender,Flights,Total Flights,Days,Hours,Minutes
0,Zhang Xiaoguang,China,M,Shenzhou 10 (2013),1,14,14,28
1,Zhai Zhigang,China,M,Shenzhou 7 (2008),1,2,20,26
2,Yury Usachov,Russia,M,Soyuz TM-18 (1994),4,552,22,24
3,Yury Usachov,Russia,M,Soyuz TM-23 (1996),4,552,22,24
4,Yury Usachov,Russia,M,STS-101 (2000),4,552,22,24
...,...,...,...,...,...,...,...,...
1278,Alan Bean,United States,M,Apollo 12 (1969),2,69,15,45
1279,Alan Bean,United States,M,Skylab 3 (1973),2,69,15,45
1280,Akihiko Hoshide,Japan,M,STS-124 (2008),2,140,17,26
1281,Akihiko Hoshide,Japan,M,Soyuz TMA-05M (2012),2,140,17,26
1282,Abdul Ahad Mohmand,Afghanistan,M,Soyuz TM-6 (1988),1,8,20,26

In [360]:
# Create new columns with Spacecraft and Year, splitting original messy 'Flights' string, set expand to True to create new columns 
astronauts[['Spacecraft','Year']] = astronauts['Flights'].str.split(' \(', expand=True)

# Since the Year will have the closing parantheses still left, let's remove it
astronauts['Year'] = astronauts['Year'].replace('\)','', regex=True)

# Drop original messy 'Flights' column
astronauts.drop('Flights', axis=1, inplace=True)

# An alternative to the above would be to use .str.get() on the split string and assign to new columns

# Drop Days, Hours, Minutes as they don't make sense anymore here since we've separated flights 
astronauts.drop(['Days', 'Hours', 'Minutes'], axis=1, inplace=True)

# Sort values by Year
astronauts.sort_values(by='Year',inplace=True)

# Set index to Name
astronauts = astronauts.set_index('Name')

# Reorder the columns
astronauts = astronauts[['Country', 'Gender', 'Spacecraft', 'Year','Total Flights']]

# Let's check - we have the new Spacecraft and Year columns 
pd.concat([astronauts.head(10),astronauts.tail(10)])

,Country,Gender,Spacecraft,Year,Total Flights
Name,,,,,
Gherman Titov,Soviet Union,M,Vostok 2,1961,1
"Virgil I. ""Gus"" Grissom",United States,M,Mercury-Redstone 4,1961,2
Yuri Gagarin,Soviet Union,M,Vostok 1,1961,1
Alan Shepard,United States,M,Mercury-Redstone 3,1961,2
John Glenn,United States,M,Mercury-Atlas 6,1962,2
Walter Schirra,United States,M,Mercury-Atlas 8,1962,3
Andriyan Nikolayev,Soviet Union,M,Vostok 3,1962,2
Scott Carpenter,United States,M,Mercury-Atlas 7,1962,1
Pavel Popovich,Soviet Union,M,Vostok 4,1962,2
Valery Bykovsky,Soviet Union,M,Vostok 5,1963,3
Hazza Al Mansouri,United Arab Emirates,M,Soyuz MS-15,2019,1
Luca Parmitano,Italy,M,Soyuz MS-13,2019,2
Kathleen Rubins,United States,F,Soyuz MS-17,2020,2
Douglas G. Hurley,United States,M,Crew Dragon Demo-2,2020,3
Sergey Kud-Sverchkov,Russia,M,Soyuz MS-17,2020,1
Anatoli Ivanishin,Russia,M,Soyuz MS-16,2020,3
Robert L. Behnken,United States,M,Crew Dragon Demo-2,2020,3
Sergey Nikolayevich Ryzhikov,Russia,M,Soyuz MS-17,2020,2
Christopher Cassidy,United States,M,Soyuz MS-16,2020,3
Ivan Vagner,Russia,M,Soyuz MS-16,2020,1